# GetLinkedFileStatus Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitLinkType..::..GetLinkedFileStatus Method
RevitLinkType Class See Also
---
Returns the LinkedFileStatus of this link.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.2
# Syntax
C#
---
```text
public LinkedFileStatus GetLinkedFileStatus()
```

Visual Basic
---
```text
Public Function GetLinkedFileStatus As LinkedFileStatus
```

Visual C++
---
```text
public:
LinkedFileStatus GetLinkedFileStatus()
```

# See Also
RevitLinkType Class
Autodesk.Revit.DB Namespace